Student: Satish Byrow

#**1. Goal**
- For this project, you need to create tables based on existing excel data spreadsheets.

#Database Design example
 ![png](Books_Core_ERD.png)

In [1]:
#Import Libraries
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine

In [2]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "admin" # (or whatever password you chose during mysql installation)
db_name = "books"
connection_str = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection_str)

#**2. Load excel Data**

In [3]:
import pandas as pd
df_users = pd.read_csv('data/users.csv')
df_users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [4]:
df_books = pd.read_csv('data/books.csv')
df_books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [5]:
df_authors = pd.read_csv('data/authors.csv')
df_authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [6]:
df_favourites = pd.read_csv('data/favourites.csv')
df_favourites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

#**2. Load excel into tables**

In [7]:
df_users.to_sql('users', engine, if_exists = 'replace')
df_books.to_sql('books', engine, if_exists = 'replace')
df_authors.to_sql('authors', engine, if_exists = 'replace')
df_favourites.to_sql('favourites', engine, if_exists = 'replace')

7

#**3. Check that each table was loaded**

In [8]:
#Check that users data was loaded
query = """SHOW TABLES;"""
pd.read_sql(query, engine)

  Tables_in_books
0         authors
1           books
2      favourites
3           users

In [10]:
# list the titles of all of John Doe's favorite books
query = """SELECT books.title, favourites.user_id
FROM books
JOIN favourites ON books.id = favourites.book_id
WHERE favourites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""
pd.read_sql(query, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1